Revit 2024 API
ParameterTypeId.DisplacementPathDepth Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DisplacementPathDepth { get; }
Visual Basic
Public Shared ReadOnly Property DisplacementPathDepth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DisplacementPathDepth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace